_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ГрафикДвиженийПоДоговору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_ГрафикДвиженийПоДоговору</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыСКлиентами</xr:Item>
				<xr:Item>AccumulationRegister.УСОERP_ГрафикДвиженийПоДоговору</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКлиентамиПоДокументам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_РасширенныйГрафикДвижений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_ВведенПодчиненныйГрафик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикДвиженияПоДоговору</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаСобытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыКлиентом</v8:Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДвиженияДоходРасход</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_ПорядокДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_ВидыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаАванс</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАванс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПриемРабот</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПриемРабот</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОстатокПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОстатокПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУдержаниеОстатокПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИтогоОстатокПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВозвратГарантийногоУдержания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВозвратГарантийногоУдержания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДДС_Аванс</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыКлиентом</v8:Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДДС_ПризнаниеДоходаРасхода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_ПорядокДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДДС_ОстатокПлатежа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыКлиентом</v8:Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДДС_ВозвратГарантийногоУдержания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыКлиентом</v8:Type>
								<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сторно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета_Аванс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета_ПризнаниеДоходаРасхода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета_ОстатокПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета_ВозвратГарантийногоУдержания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ВариантыОплатыКлиентом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВариантыОплатыКлиентом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвансДоОбеспечения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоплатаДоОтгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитПослеОтгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСОERP_ГарантийноеУдержание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитСдвиг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ВариантыОплатыПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВариантыОплатыПоставщику</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвансДоПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоплатаДоПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитПослеПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСОERP_ГарантийноеУдержание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитСдвиг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ТипыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Импорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВвозИзЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СДавальцем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПереработчиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоклажедателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СХранителем</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ПорядокДоходовРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ПорядокДоходовРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеЗатрат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыПланированияСтроительныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыПланированияСтроительныхРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Календарный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месячный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедельноСуточный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ГрафикДвиженийПоДоговору/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ПараметрыФормы;

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура 	ПриОткрытии(Отказ)													
	
	ПараметрыФормы = СтруктураПараметрыФормы();
	
	Отказ = ПараметрыФормы.Отказ;
	
	ОбновитьФормуНаКлиенте();
	
	ОбработатьГрафикиОснования();
	
	Если Объект.УСОERP_ВведенПодчиненныйГрафик И Объект.Проведен Тогда
		ЭтаФорма.ТолькоПросмотр 						= Истина;
		Элементы.Заполнить.Доступность 					= Ложь;
		Элементы.РассчитатьГрафикДвижений.Доступность 	= Ложь;
		Сообщить("По данному графику введены сторнирующие записи. Изменение документа: " + Объект.Ссылка + " запрещено!");
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
Процедура 	ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)					
	
	Если Параметры.Свойство("Договор") И ЗначениеЗаполнено(Параметры.Договор) Тогда
		Объект.Договор = Параметры.Договор;
	КонецЕсли;
			
	ЗаполнитьДанныеФормыНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура 	ПередЗаписью(Отказ, ПараметрыЗаписи)								
	
	Если Объект.ГрафикДвиженияПоДоговору.Количество() <> 0 Тогда
		
		Отказ = ПроверитьСуммыПередЗаписью();
		
		Если Отказ Тогда
			ТекстОшибки = НСтр("ru='В табличной части графика движений введены некорректные суммы!'");
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
				
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура 	ПослеЗаписи(ПараметрыЗаписи)										
	
	Если ПараметрыФормы.ДополнительноеСоглашение 
		И ПараметрыФормы.Свойство("ГрафикДвиженийПоДоговору") 
		И ЗначениеЗаполнено(ПараметрыФормы.ГрафикДвиженийПоДоговору)
		И Объект.ГрафикДвиженияПоДоговору.НайтиСтроки(Новый Структура("Сторно", Истина)).Количество() > 0 
		И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПерезаписатьГрафикОснование(ПараметрыФормы, Истина);
	ИначеЕсли ПараметрыФормы.ДополнительноеСоглашение
		И ПараметрыФормы.Свойство("ГрафикДвиженийПоДоговору")
		И ЗначениеЗаполнено(ПараметрыФормы.ГрафикДвиженийПоДоговору) Тогда
		ПерезаписатьГрафикОснование(ПараметрыФормы, Ложь);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура 	ПерезаписатьГрафикОснование(ПараметрыФормы, ВведенГрафик)			
	
	Попытка
		ГрафикОбъект = ПараметрыФормы.ГрафикДвиженийПоДоговору.ПолучитьОбъект();
		ГрафикОбъект.УСОERP_ВведенПодчиненныйГрафик = ВведенГрафик;
		ГрафикОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка! Не удалось перезаписать документ: " + ГрафикОбъект.Ссылка, 
								УровеньЖурналаРегистрации.Ошибка, 
								Метаданные.Документы.УСОERP_ГрафикДвиженийПоДоговору);
								Сообщить(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

&НаСервере
Функция 	ПроверитьСуммыПередЗаписью()										
	
	Если Объект.УСОERP_РасширенныйГрафикДвижений Тогда
		ТЗ_График = Объект.ГрафикДвиженияПоДоговору.Выгрузить(, "СуммаАванс, СуммаПриемРабот, СуммаОстатокПлатежа, СуммаВозвратГарантийногоУдержания");
		ТЗ_График.Свернуть("", "СуммаАванс, СуммаПриемРабот, СуммаОстатокПлатежа, СуммаВозвратГарантийногоУдержания");
		СтрокаИтог = ТЗ_График[0];
		Возврат ?(СтрокаИтог.СуммаАванс + СтрокаИтог.СуммаОстатокПлатежа + СтрокаИтог.СуммаВозвратГарантийногоУдержания = СтрокаИтог.СуммаПриемРабот, Ложь, Истина)
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Процедура	УСОERP_РасширенныйГрафикДвиженийПриИзменении(Элемент)					
	
	ВидыДДСпоДоговорам 	= ПараметрыФормы.ВидыДДСпоДоговорам;
	
	Если НЕ ЗначениеЗаполнено(ВидыДДСпоДоговорам) Тогда
		
		Объект.УСОERP_РасширенныйГрафикДвижений = Ложь;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 	= "Для ввода расширенного графика договор: " + Элементы.НаименованиеДоговор.Заголовок + 
							" должен иметь один из типов:"  
							+ Символы.ПС + """С поставщиком""," 
							+ Символы.ПС + """С переработчиком""," 
							+ Символы.ПС + """C давальцем"" либо" 
							+ Символы.ПС + """С покупателем"".";
		Сообщение.Сообщить();
		
	ИначеЕсли Объект.ГрафикДвиженияПоДоговору.Количество() <> 0 Тогда
		
		ОбработкаПользовательскогоВыбора_ОчисткаТЧ();
				
	КонецЕсли;
		
	ОбновитьФормуНаСервере(ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура 	РасширенныйГрафикДвиженияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)							
		
	Если НоваяСтрока И НЕ Копирование Тогда
		
		ВидыДДСпоДоговорам 	= ПараметрыФормы.ВидыДДСпоДоговорам;
		
		Элемент.ТекущиеДанные.ВидДДС_Аванс 								= ВидыДДСпоДоговорам.Аванс;
		Элемент.ТекущиеДанные.ВидДДС_ПризнаниеДоходаРасхода 			= ВидыДДСпоДоговорам.ПриемРабот;
		Элемент.ТекущиеДанные.ВидДДС_ОстатокПлатежа 					= ВидыДДСпоДоговорам.ОстатокПлатежа;
		Элемент.ТекущиеДанные.ВидДДС_ВозвратГарантийногоУдержания 		= ВидыДДСпоДоговорам.ВозвратГарантийногоУдержания;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура 	РасширенныйГрафикДвиженияРаботаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)					

	СтандартнаяОбработка = Ложь;
	
	ФормаВыбораРабот = ПолучитьФорму("Справочник.УСОERP_СтроительныеРаботы.Форма.ФормаВыбораРабот",, Элемент);
	
	ЭлементОтбора = ФормаВыбораРабот.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Утверждена");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= Истина;
	
	ЭлементОтбора = ФормаВыбораРабот.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ВидПланирования");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= ПараметрыФормы.ВидПланирования;
		
	ФормаВыбораРабот.Список.Параметры.УстановитьЗначениеПараметра("Период", Объект.Дата);
	
	ФормаВыбораРабот.Заголовок = "Строительные работы";

	ФормаВыбораРабот.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура 	БазовыйГрафикДвиженияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)					

	Если (Элемент.ТекущийЭлемент.Имя = "БазовыйГрафикДвиженияВидДвиженияДенежныхСредств"
		И НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.ВидДвиженияДенежныхСредств)) 
		ИЛИ (Элемент.ТекущийЭлемент.Имя = "БазовыйГрафикДвиженияВидДвиженияДоходРасход" 
		И НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.ВидДвиженияДоходРасход))  Тогда
		Элементы.БазовыйГрафикДвиженияВидДвиженияДоходРасход.ТолькоПросмотр 	= Ложь;
		Элементы.БазовыйГрафикДвиженияВидДвиженияДенежныхСредств.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "БазовыйГрафикДвиженияВидДвиженияДенежныхСредств"
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ВидДвиженияДенежныхСредств) Тогда
		Элемент.ТекущиеДанные.СтатьяБюджета = СтатьюБюджетаПоДопПараметрамДоговора(Элемент.ТекущиеДанные.ВидДвиженияДенежныхСредств, ПараметрыФормы);
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "БазовыйГрафикДвиженияВидДвиженияДоходРасход"
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ВидДвиженияДоходРасход) Тогда
		Элемент.ТекущиеДанные.СтатьяБюджета = ПараметрыФормы.ДополнительныеПараметрыПоДоговору.СтатьяБюджетаБДР;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура 	БазовыйГрафикДвиженияВидДвиженияДенежныхСредствПриИзменении(Элемент)
	
	Элементы.БазовыйГрафикДвиженияВидДвиженияДоходРасход.ТолькоПросмотр 	= Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура 	БазовыйГрафикДвиженияВидДвиженияДоходРасходПриИзменении(Элемент)	
	
	Элементы.БазовыйГрафикДвиженияВидДвиженияДенежныхСредств.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура 	БазовыйГрафикДвиженияПослеУдаления(Элемент)							
	
	Элементы.БазовыйГрафикДвиженияВидДвиженияДоходРасход.ТолькоПросмотр 	= Ложь;
	Элементы.БазовыйГрафикДвиженияВидДвиженияДенежныхСредств.ТолькоПросмотр = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура 	БазовыйГрафикДвиженияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)		
	
	Элементы.БазовыйГрафикДвиженияВидДвиженияДоходРасход.ТолькоПросмотр 	= Ложь;
	Элементы.БазовыйГрафикДвиженияВидДвиженияДенежныхСредств.ТолькоПросмотр = Ложь;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция 	СтатьюБюджетаПоДопПараметрамДоговора(ВидДДС, ПараметрыФормы)		
	
	Если ВидДДС = Перечисления.ВариантыОплатыКлиентом.АвансДоОбеспечения 
		ИЛИ ВидДДС = Перечисления.ВариантыОплатыПоставщику.АвансДоПодтверждения 
		ИЛИ ВидДДС = Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки 
		ИЛИ ВидДДС = Перечисления.ВариантыОплатыПоставщику.ПредоплатаДоПоступления Тогда
		
		Возврат ПараметрыФормы.ДополнительныеПараметрыПоДоговору.СтатьяБДДСАвансовогоПлатежа;
		
	ИначеЕсли ВидДДС = Перечисления.ВариантыОплатыКлиентом.КредитПослеОтгрузки 
		ИЛИ ВидДДС = Перечисления.ВариантыОплатыПоставщику.КредитПослеПоступления Тогда
		
		Возврат ПараметрыФормы.ДополнительныеПараметрыПоДоговору.СтатьяБДДСОсновногоПлатежа;
		
	ИначеЕсли ВидДДС = Перечисления.ВариантыОплатыКлиентом.УСОERP_ГарантийноеУдержание 
		ИЛИ ВидДДС = Перечисления.ВариантыОплатыПоставщику.УСОERP_ГарантийноеУдержание Тогда
		
		Возврат ПараметрыФормы.ДополнительныеПараметрыПоДоговору.СтатьяБДДСГарантийногоУдержания;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

#КонецОбласти

#Область ОбработчикиПредставленияФормы

&НаКлиенте
Процедура 	ОбновитьФормуНаКлиенте()											
	
	МассивТипов 		= ПараметрыФормы.МассивТипов;
	
	Элементы.БазовыйГрафикДвиженияВидДвиженияДенежныхСредств.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	
	Элементы.РасширенныйГрафикДвиженияВидРабот.Видимость 	= ПараметрыФормы.ДополнительныеПараметрыПоДоговору.ПоВидамРабот;
	Элементы.РасширенныйГрафикДвиженияРабота.Видимость 		= ПараметрыФормы.ДополнительныеПараметрыПоДоговору.ПоРаботам;
		
	ОбновитьФормуНаСервере(ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура 	ОбновитьФормуНаСервере(ПараметрыФормы)								
		
	Элементы.БазовыйГрафикДвижения.Видимость 		= НЕ Объект.УСОERP_РасширенныйГрафикДвижений;
	Элементы.БазовыйГрафикДвижения.Доступность 		= НЕ Объект.УСОERP_РасширенныйГрафикДвижений;
	
	Элементы.РасширенныйГрафикДвижения.Видимость 	= Объект.УСОERP_РасширенныйГрафикДвижений;
	Элементы.РасширенныйГрафикДвижения.Доступность 	= Объект.УСОERP_РасширенныйГрафикДвижений;
	
	Если ПараметрыФормы.Свойство("ДополнительныеПараметрыПоДоговору") И ЗначениеЗаполнено(ПараметрыФормы.ДополнительныеПараметрыПоДоговору.Ссылка) Тогда
		Объект.ОбъектСтроительства = ПараметрыФормы.ДополнительныеПараметрыПоДоговору.Ссылка.ОбъектСтроительства;
	КонецЕсли;
				
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиЗаполненияДанныхФормы

&НаСервере
Процедура	ЗаполнитьДанныеФормыНаСервере()										
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Дата 			= ТекущаяДата();
	КонецЕсли;
	Договор 					= Объект.Договор;
	
	Элементы.НаименованиеДоговор.Заголовок 	= Договор;
	
	Объект.Организация 			= Договор.Организация;
	Объект.Партнер 				= Договор.Партнер;
	Объект.Контрагент 			= Договор.Контрагент;
	
КонецПроцедуры

&НаСервере
Функция 	СтруктураПараметрыФормы()											
		
	ПараметрыФормы 		= Новый Структура;
	
	
	ПараметрыФормы.Вставить("Отказ", Ложь);
		
	
	НайтиДополнительныеПараметрыПоДоговору(ПараметрыФормы, Объект.Договор);
	
	
	ПараметрыФормы.Вставить("ДополнительноеСоглашение", Ложь);
	Если ПараметрыФормы.Свойство("ДополнительныеПараметрыПоДоговору") И ЗначениеЗаполнено(ПараметрыФормы.ДополнительныеПараметрыПоДоговору.Ссылка) Тогда
		ДополнительныеПараметрыПоДоговору = ПараметрыФормы.ДополнительныеПараметрыПоДоговору.Ссылка;
		Если ДополнительныеПараметрыПоДоговору.ДополнительноеСоглашение И ЗначениеЗаполнено(ДополнительныеПараметрыПоДоговору.ДоговорРодитель) Тогда
			ПараметрыФормы.ДополнительноеСоглашение = Истина;
		КонецЕсли;
	КонецЕсли;
	
	
	Если ПараметрыФормы.ДополнительноеСоглашение Тогда
		НайтиГрафикДвиженийПоДоговору(ПараметрыФормы);
	КонецЕсли;
	
	
	НайтиСоглашениеПоДоговору(ПараметрыФормы, Объект.Договор, Объект.Партнер, Объект.Контрагент);	
	
	
	ВидыДДСпоДоговорам 	= Новый Структура;
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		Если Объект.Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком 
			ИЛИ Объект.Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком Тогда
			
			ВидыДДСпоДоговорам.Вставить("Аванс", 						Перечисления.ВариантыОплатыПоставщику.АвансДоПодтверждения);
			ВидыДДСпоДоговорам.Вставить("ПриемРабот", 					Перечисления.УСОERP_ПорядокДоходовРасходов.ПоступлениеЗатрат);
			ВидыДДСпоДоговорам.Вставить("ОстатокПлатежа", 				Перечисления.ВариантыОплатыПоставщику.КредитПослеПоступления);
			ВидыДДСпоДоговорам.Вставить("ВозвратГарантийногоУдержания", Перечисления.ВариантыОплатыПоставщику.УСОERP_ГарантийноеУдержание);
			
		ИначеЕсли Объект.Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем 
			ИЛИ Объект.Договор.ТипДоговора = Перечисления.ТипыДоговоров.СДавальцем Тогда
			
			ВидыДДСпоДоговорам.Вставить("Аванс", 						Перечисления.ВариантыОплатыКлиентом.АвансДоОбеспечения);
			ВидыДДСпоДоговорам.Вставить("ПриемРабот", 					Перечисления.УСОERP_ПорядокДоходовРасходов.Реализация);
			ВидыДДСпоДоговорам.Вставить("ОстатокПлатежа", 				Перечисления.ВариантыОплатыКлиентом.КредитПослеОтгрузки);
			ВидыДДСпоДоговорам.Вставить("ВозвратГарантийногоУдержания", Перечисления.ВариантыОплатыКлиентом.УСОERP_ГарантийноеУдержание);
			
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ВидыДДСпоДоговорам", ВидыДДСпоДоговорам);
	
	
	МассивТипов = Новый Массив();   
	
	Если Объект.Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком 
		ИЛИ Объект.Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком Тогда
		МассивТипов.Добавить(Тип("ПеречислениеСсылка.ВариантыОплатыПоставщику"));
	ИначеЕсли Объект.Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем 
		ИЛИ Объект.Договор.ТипДоговора = Перечисления.ТипыДоговоров.СДавальцем Тогда
		МассивТипов.Добавить(Тип("ПеречислениеСсылка.ВариантыОплатыКлиентом"));
	КонецЕсли;
	
	ПараметрыФормы.Вставить("МассивТипов", МассивТипов);
	
	
	ПараметрыФормы.Вставить("ВидПланирования", Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный);
	
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаСервереБезКонтекста
Процедура 	НайтиДополнительныеПараметрыПоДоговору(ПараметрыФормы, Договор)		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УСОERP_ДополнительныеПараметрыПоДоговору.Ссылка КАК ДополнительныеПараметрыПоДоговору
		|ИЗ
		|	Документ.УСОERP_ДополнительныеПараметрыПоДоговору КАК УСОERP_ДополнительныеПараметрыПоДоговору
		|ГДЕ
		|	УСОERP_ДополнительныеПараметрыПоДоговору.Договор = &Договор
		|	И НЕ УСОERP_ДополнительныеПараметрыПоДоговору.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	УСОERP_ДополнительныеПараметрыПоДоговору.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыФормы.Вставить("Отказ", Истина);
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ДополнительныеПараметрыПоДоговору = Новый Структура;
		ДополнительныеПараметрыПоДоговору.Вставить("Ссылка", 							Выборка.ДополнительныеПараметрыПоДоговору);
		ДополнительныеПараметрыПоДоговору.Вставить("ПоВидамРабот", 						Выборка.ДополнительныеПараметрыПоДоговору.ПоВидамРабот);
		ДополнительныеПараметрыПоДоговору.Вставить("ПоРаботам", 						Выборка.ДополнительныеПараметрыПоДоговору.ПоРаботам);
		ДополнительныеПараметрыПоДоговору.Вставить("СтатьяБюджетаБДР",					Выборка.ДополнительныеПараметрыПоДоговору.СтатьяБюджетаБДР);
		ДополнительныеПараметрыПоДоговору.Вставить("СтатьяБДДСАвансовогоПлатежа",		Выборка.ДополнительныеПараметрыПоДоговору.СтатьяБДДСАвансовогоПлатежа);
		ДополнительныеПараметрыПоДоговору.Вставить("СтатьяБДДСОсновногоПлатежа",		Выборка.ДополнительныеПараметрыПоДоговору.СтатьяБДДСОсновногоПлатежа);
		ДополнительныеПараметрыПоДоговору.Вставить("СтатьяБДДСГарантийногоУдержания",	Выборка.ДополнительныеПараметрыПоДоговору.СтатьяБДДСГарантийногоУдержания);
		
		ПараметрыФормы.Вставить("ДополнительныеПараметрыПоДоговору", 	ДополнительныеПараметрыПоДоговору);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура 	НайтиГрафикДвиженийПоДоговору(ПараметрыФормы)						
	
	ДополнительныеПараметрыПоДоговору = ПараметрыФормы.ДополнительныеПараметрыПоДоговору.Ссылка;
	Договор = ДополнительныеПараметрыПоДоговору.ДоговорРодитель;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УСОERP_ГрафикДвиженийПоДоговору.Ссылка КАК ГрафикДвиженийПоДоговору
		|ИЗ
		|	Документ.УСОERP_ГрафикДвиженийПоДоговору КАК УСОERP_ГрафикДвиженийПоДоговору
		|ГДЕ
		|	УСОERP_ГрафикДвиженийПоДоговору.Договор = &Договор
		|	И УСОERP_ГрафикДвиженийПоДоговору.Проведен
		//|	И НЕ УСОERP_ГрафикДвиженийПоДоговору.УСОERP_ВведенПодчиненныйГрафик
		|
		|УПОРЯДОЧИТЬ ПО
		|	УСОERP_ГрафикДвиженийПоДоговору.Дата УБЫВ";
	Запрос.УстановитьПараметр("Договор", 	Договор);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ПараметрыФормы.Вставить("ГрафикДвиженийПоДоговору", Выборка.ГрафикДвиженийПоДоговору);
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура 	НайтиСоглашениеПоДоговору(ПараметрыФормы, Договор, Партнер, Контрагент)										
		
	Если Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем 
		ИЛИ Договор.ТипДоговора = Перечисления.ТипыДоговоров.СДавальцем Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УСОERP_ДоговорСЗаказчиком.Соглашение КАК СоглашениеПоДоговору
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УСОERP_ДоговорСЗаказчиком КАК УСОERP_ДоговорСЗаказчиком
		|		ПО ДоговорыКонтрагентов.Ссылка = УСОERP_ДоговорСЗаказчиком.Договор
		|ГДЕ
		|	УСОERP_ДоговорСЗаказчиком.Проведен
		|	И ДоговорыКонтрагентов.Ссылка = &Договор
		|	И УСОERP_ДоговорСЗаказчиком.Соглашение <> ЗНАЧЕНИЕ(Справочник.СоглашенияСКлиентами.ПустаяСсылка)
		|	И УСОERP_ДоговорСЗаказчиком.Соглашение.Партнер = &Партнер
		|	И УСОERP_ДоговорСЗаказчиком.Соглашение.Контрагент = &Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	УСОERP_ДоговорСЗаказчиком.Соглашение.Дата УБЫВ";
		
		Запрос.УстановитьПараметр("Договор", 	Договор);
		Запрос.УстановитьПараметр("Партнер", 	Партнер);
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ПараметрыФормы.Вставить("СоглашениеПоДоговору", Выборка.СоглашениеПоДоговору);
		КонецЕсли;
			
	ИначеЕсли Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком
		ИЛИ Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УСОERP_ДоговорССубподрядчиком.Соглашение КАК СоглашениеПоДоговору
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УСОERP_ДоговорССубподрядчиком КАК УСОERP_ДоговорССубподрядчиком
		|		ПО ДоговорыКонтрагентов.Ссылка = УСОERP_ДоговорССубподрядчиком.Договор
		|ГДЕ
		|	УСОERP_ДоговорССубподрядчиком.Проведен
		|	И ДоговорыКонтрагентов.Ссылка = &Договор
		|	И УСОERP_ДоговорССубподрядчиком.Соглашение <> ЗНАЧЕНИЕ(Справочник.СоглашенияСПоставщиками.ПустаяСсылка)
		|	И УСОERP_ДоговорССубподрядчиком.Соглашение.Партнер = &Партнер
		|	И УСОERP_ДоговорССубподрядчиком.Соглашение.Контрагент = &Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	УСОERP_ДоговорССубподрядчиком.Соглашение.Дата УБЫВ";
		
		Запрос.УстановитьПараметр("Договор", 	Договор);
		Запрос.УстановитьПараметр("Партнер", 	Партнер);
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ПараметрыФормы.Вставить("СоглашениеПоДоговору", Выборка.СоглашениеПоДоговору);
		КонецЕсли;
			
	Иначе
		
		Возврат;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура 	ОбработкаПользовательскогоВыбора_ОчисткаТЧ()						
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаПользовательскогоВыбора_ОчисткаТЧЗавершение", ЭтотОбъект), "При смене режима ввода графика движений по договору таблица движений будет очищена.", РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура 	ОбработкаПользовательскогоВыбора_ОчисткаТЧЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт		
    
    Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		Объект.ГрафикДвиженияПоДоговору.Очистить();
	Иначе
		Объект.УСОERP_РасширенныйГрафикДвижений = НЕ Объект.УСОERP_РасширенныйГрафикДвижений;
	КонецЕсли;
	
	ОбновитьФормуНаСервере(ПараметрыФормы);
    
КонецПроцедуры

&НаКлиенте
Процедура 	Заполнить(Команда)													
	
	Если Объект.ГрафикДвиженияПоДоговору.Количество() = 0 Тогда
		ЗаполнитьГрафикДвиженияПоДоговору(ПараметрыФормы);
		Модифицированность = Истина;
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьВопросПользователю", ЭтотОбъект), 
					"При автоматическом заполнении табличная часть документа будет очищена.", 
					РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура 	ЗаполнитьВопросПользователю(РезультатВопроса, ДополнительныеПараметры) Экспорт								
    
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		ЗаполнитьГрафикДвиженияПоДоговору(ПараметрыФормы);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура	ОбработатьГрафикиОснования()										
	
	Если ПараметрыФормы.ДополнительноеСоглашение 
		И ПараметрыФормы.Свойство("ГрафикДвиженийПоДоговору") 
		И ЗначениеЗаполнено(ПараметрыФормы.ГрафикДвиженийПоДоговору) 
		И Объект.ГрафикДвиженияПоДоговору.НайтиСтроки(Новый Структура("Сторно", Истина)).Количество() = 0 Тогда
	
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработатьГрафикиОснованияВопросПользователю", ЭтотОбъект), 
						"Провести корректировку графиков-оснований?", 
						РежимДиалогаВопрос.ДаНет);
					
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура 	ОбработатьГрафикиОснованияВопросПользователю(РезультатВопроса, ДополнительныеПараметры) Экспорт				
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОбработатьГрафики(ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура 	ОбработатьГрафики(ПараметрыФормы)									
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаСобытия,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДвиженияДенежныхСредств,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДвиженияДоходРасход,
		|	-УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ОбщаяСумма КАК ОбщаяСумма,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СтатьяБюджета,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Комментарий,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидРабот,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Работа,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаАванс,
		|	-УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СуммаАванс КАК СуммаАванс,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаПриемРабот,
		|	-УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СуммаПриемРабот КАК СуммаПриемРабот,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаОстатокПлатежа,
		|	-УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СуммаОстатокПлатежа КАК СуммаОстатокПлатежа,
		|	-УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СуммаУдержаниеОстатокПлатежа КАК СуммаУдержаниеОстатокПлатежа,
		|	-УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СуммаИтогоОстатокПлатежа КАК СуммаИтогоОстатокПлатежа,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ДатаВозвратГарантийногоУдержания,
		|	-УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.СуммаВозвратГарантийногоУдержания КАК СуммаВозвратГарантийногоУдержания,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДДС_Аванс,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДДС_ПризнаниеДоходаРасхода,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДДС_ОстатокПлатежа,
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.ВидДДС_ВозвратГарантийногоУдержания,
		|	ИСТИНА КАК Сторно
		|ИЗ
		|	Документ.УСОERP_ГрафикДвиженийПоДоговору.ГрафикДвиженияПоДоговору КАК УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору
		|ГДЕ
		|	УСОERP_ГрафикДвиженийПоДоговоруГрафикДвиженияПоДоговору.Ссылка = &ГрафикДвиженийПоДоговору";
	
	Запрос.УстановитьПараметр("ГрафикДвиженийПоДоговору", ПараметрыФормы.ГрафикДвиженийПоДоговору);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТЗ_ТаблицаГрафикаОснования 	= РезультатЗапроса.Выгрузить();
	
	Объект.ГрафикДвиженияПоДоговору.Очистить();
	Объект.ГрафикДвиженияПоДоговору.Загрузить(ТЗ_ТаблицаГрафикаОснования);
	Элементы.УСОERP_РасширенныйГрафикДвижений.ТолькоПросмотр = Истина;
	ЭтаФорма.Модифицированность = Истина;
	ОбновитьФормуНаСервере(ПараметрыФормы);
			
КонецПроцедуры

&НаСервере
Процедура 	ЗаполнитьГрафикДвиженияПоДоговору(ПараметрыФормы)					
	
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_ГрафикДвиженийПоДоговору_ЗаполнитьГрафикДвиженияПоДоговору(ЭтотОбъект, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура 	РассчитатьГрафикДвижений(Команда)									
	
	РассчитатьГрафикДвиженийНаСервере(ПараметрыФормы);
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура 	РассчитатьГрафикДвиженийНаСервере(ПараметрыФормы)					
	
	// Перезаполняем соглашение по договору
	Если НЕ ПараметрыФормы.Свойство("СоглашениеПоДоговору") Тогда
		НайтиСоглашениеПоДоговору(ПараметрыФормы, Объект.Договор, Объект.Партнер, Объект.Контрагент);
	ИначеЕсли НЕ ЗначениеЗаполнено(ПараметрыФормы.СоглашениеПоДоговору) Тогда
		НайтиСоглашениеПоДоговору(ПараметрыФормы, Объект.Договор, Объект.Партнер, Объект.Контрагент);
	КонецЕсли;
	
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_ГрафикДвиженийПоДоговору_РассчитатьГрафикДвиженийНаСервере(ЭтотОбъект, ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти
